<?php

// Задаем исходную матрицу
$arr = [
	[0,0,1,1,0,1,1,1,0,0,1,1,0],
	[0,0,1,1,0,0,1,1,0,1,1,0,0],
	[0,0,0,1,0,1,1,1,0,1,0,0,0],
	[0,0,0,0,1,1,1,1,1,0,0,1,0],
	[0,0,1,0,1,1,1,1,1,0,1,0,0],
	[0,0,1,1,1,1,1,1,1,1,1,1,1],
	[0,0,1,1,1,1,1,1,1,1,1,0,0],
	[0,0,1,0,0,0,1,0,0,0,0,1,1],
	[0,0,1,0,1,0,0,1,1,1,0,0,1],
	[0,0,0,0,1,0,0,1,0,1,0,0,0]
];

// Генерация рандомной матрицы, если хотите
// $arr = array();
// for($i=0; $i < 10; $i++)
// 	for($j=0; $j < 13; $j++)
// 		$arr[$i][$j] = rand(0,1);

// Выводим исходную матрицу
echo "Исходная матрица: <br/>";
foreach($arr as $str) {
	foreach($str as $elem) {
		echo $elem . " ";
	}
	echo "<br/>";
}
echo "<br/>";

// Алгоритм поиска максимальной единичной подматрицы
$max_side = 0;
for($i=0; $i < count($arr); $i++) {
	for($j=0; $j < count($arr[0]); $j++) {
		if($arr[$i][$j] == 1) $arr[$i][$j] = min($arr[$i][$j-1], $arr[$i-1][$j], $arr[$i-1][$j-1]) + 1;
		if($arr[$i][$j] > $max_side) {
			$max_side = $arr[$i][$j];
			$x = $j; $y = $i;
		}
	}
}

// Считаем координаты найденной матрицы
$x++; $y++;
$right_down = "($y, $x)";
$left_down = "($y, ". (($x+1) - $max_side) .")";
$right_top = "(". (($y+1) - $max_side) .", $x)";
$left_top = "(". (($y+1) - $max_side) .", ". (($x+1) - $max_side) .")";

// Выводим матрицу, полученную в результате вычислений
echo "Матрица, полученная в результате поиска макс. единичной квадратной подматрицы: <br/>";
foreach($arr as $str) {
	foreach($str as $elem) {
		echo $elem . " ";
	}
	echo "<br/>";
}
echo "<br/>";

echo "Площадь наибольшей квадратной подматрицы состоящей только из единиц - ". $max_side*$max_side ."<br/>";
echo "Длина одной стороны - ". $max_side ."<br/>";
printf("Координаты подматрицы: <br/> %s %s <br/> %s %s", $left_top, $right_top, $left_down, $right_down);

